schedule.org
#+OPTIONS: toc:nil H:2 num:0 \n:t

#+BEGIN_COMMENT
org export to HTML
remove header before yaml
remove postamble
save as md file
#+END_COMMENT

#+BEGIN_EXPORT html
---
layout: page_2023
title: Schedule
year: 2023
permalink: /2023/schedule/
---
<script src="https://code.jquery.com/jquery-3.1.1.js"
        integrity="sha256-16cdPddA6VdVInumRGo6IbivbERE8p7CQR3HzTBuELA="
        crossorigin="anonymous"></script>

<script>
 $(document).ready(function(){
     $('td:contains("Pset")').closest('tr').css('background-color','LemonChiffon');
     $('td:contains("Exam")').closest('tr').css('background-color','LightSalmon');
 });
</script>

Lecture slides and Jupyter notebooks can be found [here](https://drive.google.com/drive/folders/117sLpWGyqBjMILgibwnofzY0adactYiM?usp=sharing).

#+END_EXPORT
| Lecture 1          | Jan. 30 | overview, simple perceptrons    |
| Lecture 2          | Feb. 1  | stochastic gradient descent     |
| Pset 0 optional    | Feb. 3  | math review                     |
| Lecture 3          | Feb. 6  | multilayer perceptrons          |
| Lecture 4          | Feb. 8  | convolution and pooling         |
| Pset 1 due         | Feb. 10 | perceptrons                     |
| Lecture 5          | Feb. 13 | visual object recognition       |
| Lecture 6          | Feb. 15 | generalization & regularization |
| Pset 2 due         | Feb. 17 | convolutional nets              |
| Exam               | Feb. 20 |                                 |
| Lecture 7          | Feb. 22 | exam retrospective              |
| Lecture 8          | Feb. 27 | BatchNorm, transfer learning    |
| Lecture 9          | Mar. 1  | object detection                |
| Pset 3 due         | Mar. 3  | object classification/detection |
| Lecture 10         | Mar. 6  | deconvolution layers            |
| Lecture 11         | Mar. 8  | segmentation                    |
| Pset 4 due         | Mar. 10 | segmentation and denoising      |
| Break              |         |                                 |
| Lecture 12         | Mar. 20 | diffusion models                |
| Lecture 13         | Mar. 22 | attention                       |
| Pset 5 due         | Mar. 24 | diffusion models                |
| Lecture 14         | Mar. 27 | transformers                    |
| Lecture 15         | Mar. 29 | language modeling               |
| Pset 6 due         | Mar. 31 | transformers                    |
| Lecture 16         | Apr. 3  | LLMs                            |
| Exam               | Apr. 5  |                                 |
| Lecture 17         | Apr. 10 | conditional image generation    |
| Lecture 18         | Apr. 12 | policy gradient                 |
| Project            | Apr. 14 | proposal due                    |
| Lecture 19         | Apr. 17 | prompt engineering, RLHF        |
| Lecture 20         | Apr. 19 | project meetings                |
| Project            | Apr. 21 | status report                   |
| Lecture 21         | Apr. 24 | AI safety                       |
| Lecture 22         | Apr. 26 | project meetings                |
| Final project      | May 9   | (Dean's date)                   |
