2023/schedule.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-25 Sat 07:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Sebastian Seung" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
---
layout: page_2023
title: Schedule
year: 2023
permalink: /2023/schedule/
---
<script src="https://code.jquery.com/jquery-3.1.1.js"
        integrity="sha256-16cdPddA6VdVInumRGo6IbivbERE8p7CQR3HzTBuELA="
        crossorigin="anonymous"></script>

<script>
 $(document).ready(function(){
     $('td:contains("Pset")').closest('tr').css('background-color','LemonChiffon');
     $('td:contains("exam")').closest('tr').css('background-color','LightSalmon');
 });
</script>

Lecture slides and Jupyter notebooks can be found [here](https://drive.google.com/drive/folders/117sLpWGyqBjMILgibwnofzY0adactYiM?usp=sharing).
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Lecture 1</td>
<td class="org-left">Jan. 30</td>
<td class="org-left">overview, simple perceptrons</td>
</tr>

<tr>
<td class="org-left">Lecture 2</td>
<td class="org-left">Feb. 1</td>
<td class="org-left">stochastic gradient descent</td>
</tr>

<tr>
<td class="org-left">Pset 0 optional</td>
<td class="org-left">Feb. 3</td>
<td class="org-left">math review</td>
</tr>

<tr>
<td class="org-left">Lecture 3</td>
<td class="org-left">Feb. 6</td>
<td class="org-left">multilayer perceptrons</td>
</tr>

<tr>
<td class="org-left">Lecture 4</td>
<td class="org-left">Feb. 8</td>
<td class="org-left">convolution and pooling</td>
</tr>

<tr>
<td class="org-left">Pset 1 due</td>
<td class="org-left">Feb. 10</td>
<td class="org-left">perceptrons</td>
</tr>

<tr>
<td class="org-left">Lecture 5</td>
<td class="org-left">Feb. 13</td>
<td class="org-left">visual object recognition</td>
</tr>

<tr>
<td class="org-left">Lecture 6</td>
<td class="org-left">Feb. 15</td>
<td class="org-left">generalization &amp; regularization</td>
</tr>

<tr>
<td class="org-left">Pset 2 due</td>
<td class="org-left">Feb. 17</td>
<td class="org-left">convolutional nets</td>
</tr>

<tr>
<td class="org-left">Exam</td>
<td class="org-left">Feb. 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture 7</td>
<td class="org-left">Feb. 22</td>
<td class="org-left">exam retrospective</td>
</tr>

<tr>
<td class="org-left">Lecture 8</td>
<td class="org-left">Feb. 27</td>
<td class="org-left">BatchNorm, transfer learning</td>
</tr>

<tr>
<td class="org-left">Lecture 9</td>
<td class="org-left">Mar. 1</td>
<td class="org-left">object detection</td>
</tr>

<tr>
<td class="org-left">Pset 3 due</td>
<td class="org-left">Mar. 3</td>
<td class="org-left">object classification/detection</td>
</tr>

<tr>
<td class="org-left">Lecture 10</td>
<td class="org-left">Mar. 6</td>
<td class="org-left">deconvolution layers</td>
</tr>

<tr>
<td class="org-left">Lecture 11</td>
<td class="org-left">Mar. 8</td>
<td class="org-left">segmentation</td>
</tr>

<tr>
<td class="org-left">Pset 4 due</td>
<td class="org-left">Mar. 10</td>
<td class="org-left">segmentation and denoising</td>
</tr>

<tr>
<td class="org-left">Break</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture 12</td>
<td class="org-left">Mar. 20</td>
<td class="org-left">diffusion models</td>
</tr>

<tr>
<td class="org-left">Lecture 13</td>
<td class="org-left">Mar. 22</td>
<td class="org-left">attention</td>
</tr>

<tr>
<td class="org-left">Pset 5 due</td>
<td class="org-left">Mar. 24</td>
<td class="org-left">diffusion models</td>
</tr>

<tr>
<td class="org-left">Lecture 14</td>
<td class="org-left">Mar. 27</td>
<td class="org-left">transformers</td>
</tr>

<tr>
<td class="org-left">Lecture 15</td>
<td class="org-left">Mar. 29</td>
<td class="org-left">language modeling</td>
</tr>

<tr>
<td class="org-left">Pset 6 due</td>
<td class="org-left">Mar. 31</td>
<td class="org-left">transformers</td>
</tr>

<tr>
<td class="org-left">Lecture 16</td>
<td class="org-left">Apr. 3</td>
<td class="org-left">LLMs</td>
</tr>

<tr>
<td class="org-left">Exam</td>
<td class="org-left">Apr. 5</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture 17</td>
<td class="org-left">Apr. 10</td>
<td class="org-left">conditional image generation</td>
</tr>

<tr>
<td class="org-left">Lecture 18</td>
<td class="org-left">Apr. 12</td>
<td class="org-left">policy gradient</td>
</tr>

<tr>
<td class="org-left">Project</td>
<td class="org-left">Apr. 14</td>
<td class="org-left">proposal due</td>
</tr>

<tr>
<td class="org-left">Lecture 19</td>
<td class="org-left">Apr. 17</td>
<td class="org-left">prompt engineering, RLHF</td>
</tr>

<tr>
<td class="org-left">Lecture 20</td>
<td class="org-left">Apr. 19</td>
<td class="org-left">project meetings</td>
</tr>

<tr>
<td class="org-left">Project</td>
<td class="org-left">Apr. 21</td>
<td class="org-left">status report</td>
</tr>

<tr>
<td class="org-left">Lecture 21</td>
<td class="org-left">Apr. 24</td>
<td class="org-left">AI safety</td>
</tr>

<tr>
<td class="org-left">Lecture 22</td>
<td class="org-left">Apr. 26</td>
<td class="org-left">project meetings</td>
</tr>

<tr>
<td class="org-left">Final project</td>
<td class="org-left">May 9</td>
<td class="org-left">(Dean's date)</td>
</tr>
</tbody>
</table>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sebastian Seung</p>
<p class="date">Created: 2023-02-25 Sat 07:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
